// ============================================================
// Завдання 4
// ============================================================
/**
 Поясни у вигляді коментаря — в якому порядку виведуться рядки і чому.
 Потім запусти і перевір.

 Порядок: 
 1, 4. 
 Далі 3, бо Promise має вищий пріоритет ніж setTimeout, 
 який потрапляє в Callback Queue.
 Потім 2, тому що setTimeout потрапляє в Callback Queue, 
 яка виконується після Microtask Queue.
 */

console.log("1");
setTimeout(function() { console.log("2"); }, 0);
Promise.resolve().then(function() { console.log("3"); });
console.log("4");

// Ваш коментар (порядок та причина):
//
// Підказка: окрім Callback Queue є ще Microtask Queue (для Promise),
// яка має вищий пріоритет!